'use strict';
const errors = require('egg-errors');

module.exports = {
  400001: { status: 400, code: 400001, msg: '账户已被禁用' },
  400002: { status: 400, code: 400002, msg: '密码验证失败，请重试' },
  400003: { status: 400, code: 400003, msg: '用户名已被注册' },
  400004: { status: 400, code: 400004, msg: '用户未找到' },
  400005: { status: 400, code: 400005, msg: '请传入token' },
  400006: { status: 400, code: 400006, msg: '未查找到用户资料' },
  400007: { status: 400, code: 400007, msg: '手机已被注册' },
  400008: { status: 400, code: 400008, msg: '验证失败，请重试！' },
  400009: { status: 400, code: 400009, msg: '已经绑定二次验证不能重复绑定！' },
  400010: { status: 400, code: 400010, msg: '未找到绑定的验证信息' },
  400011: { status: 400, code: 400011, msg: '请输入二次验证的密码' },
  400012: { status: 400, code: 400012, msg: '没有权限操作' },
  400013: { status: 400, code: 400013, msg: '邮箱验证码错误！' },

  // 微信
  401001: { status: 200, code: 401001, msg: '微信授权失败！' },

  // 业务相关
  500001: { status: 400, code: 500001, msg: '请完成所有流程后重试' },
  500002: { status: 400, code: 500002, msg: '海报正在生成，请稍后重试' },
  500003: { status: 400, code: 500003, msg: '已审核通过且支付不允许再次修改' },
  500004: { status: 400, code: 500004, msg: '不可以把自己作为自己的上级' },
  500005: { status: 400, code: 500005, msg: '未找到该部门信息' },


  // 文件相关
  400101: { status: 400, code: 400101, msg: '未找到对应文件或文件已被删除' },
  400102: { status: 400, code: 400102, msg: '文件上传失败' },
  400103: { status: 400, code: 400103, msg: '导出文件失败，请重试！' },

  // 验证相关
  400201: { status: 400, code: 400201, msg: '请输入验证码' },
  400202: { status: 400, code: 400202, msg: '验证码已超时，请重试' },
  400203: { status: 400, code: 400203, msg: '验证码错误，请重试' },


  // 群组相关
  400301: { status: 400, code: 400301, msg: '没有权限操作' },


  // 支付相关
  400801: { status: 400, code: 400801, msg: '支付方式未找到' },
  400802: { status: 400, code: 400802, msg: '已支付过了，不可以再支付' },


  // 系统底层相关
  400901: { status: 400, code: 400901, msg: '不允许删除该条信息' },
  400902: { status: 400, code: 400902, msg: '文件上传失败' },
  400903: { status: 400, code: 400903, msg: '未查找到信息' },
  400904: { status: 400, code: 400904, msg: '权限不足' },
  400905: { status: 400, code: 400905, msg: '为查询到该登录方式' },

  // 预约相关
  4001001: { status: 400, code: 4001001, msg: '您已经预约过了' },

  errors,
};
